#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.6`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mdata.azurerm_location.current: Reading...[0m[0m
[0m[1mdata.azurerm_managed_api.managed_api_arm: Reading...[0m[0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.storage_account.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.storage_account.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mdata.azurerm_subscription.current: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mdata.azurerm_managed_api.managed_api_arm: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/providers/Microsoft.Web/locations/northeurope/managedApis/arm][0m
[0m[1mdata.azurerm_subscription.current: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mdata.azurerm_location.current: Read complete after 2s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/locations/northeurope][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_logic_app[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_logic_app" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # azapi_resource.api_connection_arm[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "api_connection_arm" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m kind       = "V2"
              [32m+[0m[0m properties = {
                  [32m+[0m[0m api                   = {
                      [32m+[0m[0m brandColor  = "#003056"
                      [32m+[0m[0m description = "Azure Resource Manager exposes the APIs to manage all of your Azure resources."
                      [32m+[0m[0m displayName = "Azure Resource Manager"
                      [32m+[0m[0m iconUri     = "https://connectoricons-prod.azureedge.net/u/shgogna/globalperconnector-train1/1.0.1639.3310/arm/icon.png"
                      [32m+[0m[0m id          = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/providers/Microsoft.Web/locations/northeurope/managedApis/arm"
                      [32m+[0m[0m name        = "arm"
                      [32m+[0m[0m type        = "Microsoft.Web/locations/managedApis"
                    }
                  [32m+[0m[0m customParameterValues = {}
                  [32m+[0m[0m parameterValueType    = "Alternative"
                  [32m+[0m[0m testLinks             = []
                }
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = "northeurope"
      [32m+[0m[0m name                      = "seclogic-dev-api-arm001"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = (known after apply)
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = false
      [32m+[0m[0m tags                      = {}
      [32m+[0m[0m type                      = "Microsoft.Web/connections@2016-06-01"
    }

[1m  # azapi_resource.api_connection_arm_access_policy[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "api_connection_arm_access_policy" {
      [32m+[0m[0m body                      = (known after apply)
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = "northeurope"
      [32m+[0m[0m name                      = (known after apply)
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = (known after apply)
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = false
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.Web/connections/accessPolicies@2016-06-01"
    }

[1m  # azapi_resource.storage_file_share[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "storage_file_share" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m accessTier       = "TransactionOptimized"
                  [32m+[0m[0m enabledProtocols = "SMB"
                  [32m+[0m[0m shareQuota       = 5120
                }
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m name                      = "logicapp"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = (known after apply)
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m type                      = "Microsoft.Storage/storageAccounts/fileServices/shares@2022-09-01"
    }

[1m  # azapi_resource.subnet_logic_app[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "subnet_logic_app" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m addressPrefix                     = "10.3.1.64/26"
                  [32m+[0m[0m delegations                       = [
                      [32m+[0m[0m {
                          [32m+[0m[0m name       = "LogicAppDelegation"
                          [32m+[0m[0m properties = {
                              [32m+[0m[0m serviceName = "Microsoft.Web/serverFarms"
                            }
                        },
                    ]
                  [32m+[0m[0m ipAllocations                     = []
                  [32m+[0m[0m networkSecurityGroup              = {
                      [32m+[0m[0m id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001"
                    }
                  [32m+[0m[0m privateEndpointNetworkPolicies    = "Enabled"
                  [32m+[0m[0m privateLinkServiceNetworkPolicies = "Enabled"
                  [32m+[0m[0m routeTable                        = {
                      [32m+[0m[0m id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001"
                    }
                  [32m+[0m[0m serviceEndpointPolicies           = []
                  [32m+[0m[0m serviceEndpoints                  = []
                }
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m name                      = "LogicAppSubnet"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001"
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m type                      = "Microsoft.Network/virtualNetworks/subnets@2022-07-01"
    }

[1m  # azapi_resource.subnet_private_endpoints[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "subnet_private_endpoints" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m addressPrefix                     = "10.3.1.128/26"
                  [32m+[0m[0m delegations                       = []
                  [32m+[0m[0m ipAllocations                     = []
                  [32m+[0m[0m networkSecurityGroup              = {
                      [32m+[0m[0m id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001"
                    }
                  [32m+[0m[0m privateEndpointNetworkPolicies    = "Enabled"
                  [32m+[0m[0m privateLinkServiceNetworkPolicies = "Enabled"
                  [32m+[0m[0m routeTable                        = {
                      [32m+[0m[0m id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001"
                    }
                  [32m+[0m[0m serviceEndpointPolicies           = []
                  [32m+[0m[0m serviceEndpoints                  = []
                }
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m name                      = "PeLogicAppSubnet"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001"
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m type                      = "Microsoft.Network/virtualNetworks/subnets@2022-07-01"
    }

[1m  # azurerm_key_vault_secret.key_vault_secret_sample[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_sample" {
      [32m+[0m[0m content_type            = "text/plain"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = (known after apply)
      [32m+[0m[0m name                    = "MySampleSecret"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # azurerm_logic_app_standard.logic_app[0m will be created
[0m  [32m+[0m[0m resource "azurerm_logic_app_standard" "logic_app" {
      [32m+[0m[0m app_service_plan_id            = (known after apply)
      [32m+[0m[0m app_settings                   = (known after apply)
      [32m+[0m[0m bundle_version                 = "[1.*, 2.0.0)"
      [32m+[0m[0m client_affinity_enabled        = false
      [32m+[0m[0m client_certificate_mode        = "Required"
      [32m+[0m[0m custom_domain_verification_id  = (known after apply)
      [32m+[0m[0m default_hostname               = (known after apply)
      [32m+[0m[0m enabled                        = true
      [32m+[0m[0m https_only                     = true
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m kind                           = (known after apply)
      [32m+[0m[0m location                       = "northeurope"
      [32m+[0m[0m name                           = "seclogic-dev-la001"
      [32m+[0m[0m outbound_ip_addresses          = (known after apply)
      [32m+[0m[0m possible_outbound_ip_addresses = (known after apply)
      [32m+[0m[0m resource_group_name            = "seclogic-dev-app-rg"
      [32m+[0m[0m site_credential                = (known after apply)
      [32m+[0m[0m storage_account_access_key     = (sensitive value)
      [32m+[0m[0m storage_account_name           = "seclogicdevstg001"
      [32m+[0m[0m storage_account_share_name     = "logicapp"
      [32m+[0m[0m use_extension_bundle           = true
      [32m+[0m[0m version                        = "~4"
      [32m+[0m[0m virtual_network_subnet_id      = (known after apply)

      [32m+[0m[0m connection_string (known after apply)

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }

      [32m+[0m[0m site_config {
          [32m+[0m[0m always_on                        = false
          [32m+[0m[0m app_scale_limit                  = 0
          [32m+[0m[0m auto_swap_slot_name              = (known after apply)
          [32m+[0m[0m dotnet_framework_version         = "v6.0"
          [32m+[0m[0m elastic_instance_minimum         = 1
          [32m+[0m[0m ftps_state                       = "Disabled"
          [32m+[0m[0m http2_enabled                    = true
          [32m+[0m[0m ip_restriction                   = []
          [32m+[0m[0m linux_fx_version                 = (known after apply)
          [32m+[0m[0m min_tls_version                  = "1.2"
          [32m+[0m[0m pre_warmed_instance_count        = 1
          [32m+[0m[0m public_network_access_enabled    = true
          [32m+[0m[0m runtime_scale_monitoring_enabled = true
          [32m+[0m[0m scm_ip_restriction               = []
          [32m+[0m[0m scm_min_tls_version              = "1.2"
          [32m+[0m[0m scm_type                         = "None"
          [32m+[0m[0m scm_use_main_ip_restriction      = false
          [32m+[0m[0m use_32_bit_worker_process        = false
          [32m+[0m[0m vnet_route_all_enabled           = true
          [32m+[0m[0m websockets_enabled               = false

          [32m+[0m[0m cors (known after apply)
        }
    }

[1m  # azurerm_monitor_action_group.monitor_action_group[0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_action_group" "monitor_action_group" {
      [32m+[0m[0m enabled             = true
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "global"
      [32m+[0m[0m name                = "seclogic-dev-ag001"
      [32m+[0m[0m resource_group_name = "seclogic-dev-logging-rg"
      [32m+[0m[0m short_name          = "seclogic-de"
    }

[1m  # azurerm_monitor_activity_log_alert.monitor_activity_log_alert_service_health[0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_activity_log_alert" "monitor_activity_log_alert_service_health" {
      [32m+[0m[0m description         = "Alerts about service health and maintenance events."
      [32m+[0m[0m enabled             = true
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "global"
      [32m+[0m[0m name                = "seclogic-dev-alert-servicehealth"
      [32m+[0m[0m resource_group_name = "seclogic-dev-logging-rg"
      [32m+[0m[0m scopes              = [
          [32m+[0m[0m "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0",
        ]

      [32m+[0m[0m action {
          [32m+[0m[0m action_group_id    = (known after apply)
          [32m+[0m[0m webhook_properties = {
              [32m+[0m[0m "alert-type"   = "service-health"
              [32m+[0m[0m "environment"  = "dev"
              [32m+[0m[0m "location"     = "northeurope"
              [32m+[0m[0m "severity"     = "Info"
              [32m+[0m[0m "subscription" = "1fdab118-1638-419a-8b12-06c9543714a0"
            }
        }

      [32m+[0m[0m criteria {
          [32m+[0m[0m category = "ServiceHealth"

          [32m+[0m[0m resource_health (known after apply)

          [32m+[0m[0m service_health {
              [32m+[0m[0m events    = [
                  [32m+[0m[0m "Incident",
                  [32m+[0m[0m "Maintenance",
                ]
              [32m+[0m[0m locations = [
                  [32m+[0m[0m "Global",
                  [32m+[0m[0m "North Europe",
                ]
            }
        }
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_logic_app[0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_logic_app" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "logAnalytics"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # azurerm_private_endpoint.logic_app_private_endpoint[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "logic_app_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "seclogic-dev-la001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "seclogic-dev-la001-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "seclogic-dev-app-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "seclogic-dev-la001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "seclogic-dev-la001-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "sites",
            ]
        }
    }

[1m  # azurerm_resource_group.app_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "app_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "seclogic-dev-app-rg"
    }

[1m  # azurerm_resource_group.logging_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "logging_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "seclogic-dev-logging-rg"
    }

[1m  # azurerm_role_assignment.logic_app_role_assignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "logic_app_role_assignment_key_vault" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Secrets User"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.logic_app_role_assignment_storage[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "logic_app_role_assignment_storage" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Owner"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.app_service_plan.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_service_plan" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.app_service_plan.azurerm_monitor_diagnostic_setting.diagnostic_setting_service_plan["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_service_plan" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.app_service_plan.azurerm_service_plan.service_plan[0m will be created
[0m  [32m+[0m[0m resource "azurerm_service_plan" "service_plan" {
      [32m+[0m[0m id                           = (known after apply)
      [32m+[0m[0m kind                         = (known after apply)
      [32m+[0m[0m location                     = "northeurope"
      [32m+[0m[0m maximum_elastic_worker_count = 20
      [32m+[0m[0m name                         = "seclogic-dev-asp001"
      [32m+[0m[0m os_type                      = "Windows"
      [32m+[0m[0m per_site_scaling_enabled     = false
      [32m+[0m[0m reserved                     = (known after apply)
      [32m+[0m[0m resource_group_name          = "seclogic-dev-app-rg"
      [32m+[0m[0m sku_name                     = "WS1"
      [32m+[0m[0m worker_count                 = 1
      [32m+[0m[0m zone_balancing_enabled       = false
    }

[1m  # module.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_application_insights" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.application_insights.azurerm_application_insights.application_insights[0m will be created
[0m  [32m+[0m[0m resource "azurerm_application_insights" "application_insights" {
      [32m+[0m[0m app_id                                = (known after apply)
      [32m+[0m[0m application_type                      = "other"
      [32m+[0m[0m connection_string                     = (sensitive value)
      [32m+[0m[0m daily_data_cap_in_gb                  = 100
      [32m+[0m[0m daily_data_cap_notifications_disabled = false
      [32m+[0m[0m disable_ip_masking                    = false
      [32m+[0m[0m force_customer_storage_for_profiler   = false
      [32m+[0m[0m id                                    = (known after apply)
      [32m+[0m[0m instrumentation_key                   = (sensitive value)
      [32m+[0m[0m internet_ingestion_enabled            = true
      [32m+[0m[0m internet_query_enabled                = true
      [32m+[0m[0m local_authentication_disabled         = false
      [32m+[0m[0m location                              = "northeurope"
      [32m+[0m[0m name                                  = "seclogic-dev-appi001"
      [32m+[0m[0m resource_group_name                   = "seclogic-dev-logging-rg"
      [32m+[0m[0m retention_in_days                     = 90
      [32m+[0m[0m sampling_percentage                   = 100
      [32m+[0m[0m workspace_id                          = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
    }

[1m  # module.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_key_vault" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.key_vault.azurerm_key_vault.key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault" "key_vault" {
      [32m+[0m[0m access_policy                   = []
      [32m+[0m[0m enable_rbac_authorization       = true
      [32m+[0m[0m enabled_for_deployment          = false
      [32m+[0m[0m enabled_for_disk_encryption     = false
      [32m+[0m[0m enabled_for_template_deployment = false
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m location                        = "northeurope"
      [32m+[0m[0m name                            = "seclogic-dev-kv001"
      [32m+[0m[0m public_network_access_enabled   = false
      [32m+[0m[0m purge_protection_enabled        = true
      [32m+[0m[0m resource_group_name             = "seclogic-dev-app-rg"
      [32m+[0m[0m sku_name                        = "standard"
      [32m+[0m[0m soft_delete_retention_days      = 7
      [32m+[0m[0m tenant_id                       = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
      [32m+[0m[0m vault_uri                       = (known after apply)

      [32m+[0m[0m contact (known after apply)

      [32m+[0m[0m network_acls {
          [32m+[0m[0m bypass         = "AzureServices"
          [32m+[0m[0m default_action = "Deny"
        }
    }

[1m  # module.key_vault.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_key_vault" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_cognitive_account_vault" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "seclogic-dev-kv001-vault-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "seclogic-dev-kv001-vault-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "seclogic-dev-app-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "seclogic-dev-kv001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "seclogic-dev-kv001-vault-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "vault",
            ]
        }
    }

[1m  # module.key_vault.azurerm_role_assignment.current_roleassignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "current_roleassignment_key_vault" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "973df2ad-4e5e-4e8b-9df6-17f61e9efd55"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Administrator"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.key_vault.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "120s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.storage_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_storage_account" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.storage_account.azurerm_monitor_diagnostic_setting.diagnostic_setting_storage_account["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_storage_account" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["blob"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_storage_account" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "seclogicdevstg001-blob-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "seclogicdevstg001-blob-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "seclogic-dev-app-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "seclogicdevstg001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "seclogicdevstg001-blob-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "blob",
            ]
        }
    }

[1m  # module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["file"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_storage_account" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "seclogicdevstg001-file-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "seclogicdevstg001-file-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "seclogic-dev-app-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "seclogicdevstg001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "seclogicdevstg001-file-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "file",
            ]
        }
    }

[1m  # module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["queue"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_storage_account" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "seclogicdevstg001-queue-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "seclogicdevstg001-queue-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "seclogic-dev-app-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "seclogicdevstg001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "seclogicdevstg001-queue-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "queue",
            ]
        }
    }

[1m  # module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["table"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_storage_account" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "seclogicdevstg001-table-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "seclogicdevstg001-table-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "seclogic-dev-app-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "seclogicdevstg001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.table.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "seclogicdevstg001-table-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "table",
            ]
        }
    }

[1m  # module.storage_account.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "current_roleassignment_storage_blob_data_owner" {
      [32m+[0m[0m description                      = "Required for creating data plane artifacts"
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "973df2ad-4e5e-4e8b-9df6-17f61e9efd55"
      [32m+[0m[0m principal_type                   = "ServicePrincipal"
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Owner"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.storage_account.azurerm_storage_account.storage_account[0m will be created
[0m  [32m+[0m[0m resource "azurerm_storage_account" "storage_account" {
      [32m+[0m[0m access_tier                        = "Hot"
      [32m+[0m[0m account_kind                       = "StorageV2"
      [32m+[0m[0m account_replication_type           = "ZRS"
      [32m+[0m[0m account_tier                       = "Standard"
      [32m+[0m[0m allow_nested_items_to_be_public    = false
      [32m+[0m[0m allowed_copy_scope                 = "AAD"
      [32m+[0m[0m cross_tenant_replication_enabled   = false
      [32m+[0m[0m default_to_oauth_authentication    = true
      [32m+[0m[0m dns_endpoint_type                  = "Standard"
      [32m+[0m[0m https_traffic_only_enabled         = true
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m infrastructure_encryption_enabled  = true
      [32m+[0m[0m is_hns_enabled                     = false
      [32m+[0m[0m large_file_share_enabled           = false
      [32m+[0m[0m local_user_enabled                 = true
      [32m+[0m[0m location                           = "northeurope"
      [32m+[0m[0m min_tls_version                    = "TLS1_2"
      [32m+[0m[0m name                               = "seclogicdevstg001"
      [32m+[0m[0m nfsv3_enabled                      = false
      [32m+[0m[0m primary_access_key                 = (sensitive value)
      [32m+[0m[0m primary_blob_connection_string     = (sensitive value)
      [32m+[0m[0m primary_blob_endpoint              = (known after apply)
      [32m+[0m[0m primary_blob_host                  = (known after apply)
      [32m+[0m[0m primary_blob_internet_endpoint     = (known after apply)
      [32m+[0m[0m primary_blob_internet_host         = (known after apply)
      [32m+[0m[0m primary_blob_microsoft_endpoint    = (known after apply)
      [32m+[0m[0m primary_blob_microsoft_host        = (known after apply)
      [32m+[0m[0m primary_connection_string          = (sensitive value)
      [32m+[0m[0m primary_dfs_endpoint               = (known after apply)
      [32m+[0m[0m primary_dfs_host                   = (known after apply)
      [32m+[0m[0m primary_dfs_internet_endpoint      = (known after apply)
      [32m+[0m[0m primary_dfs_internet_host          = (known after apply)
      [32m+[0m[0m primary_dfs_microsoft_endpoint     = (known after apply)
      [32m+[0m[0m primary_dfs_microsoft_host         = (known after apply)
      [32m+[0m[0m primary_file_endpoint              = (known after apply)
      [32m+[0m[0m primary_file_host                  = (known after apply)
      [32m+[0m[0m primary_file_internet_endpoint     = (known after apply)
      [32m+[0m[0m primary_file_internet_host         = (known after apply)
      [32m+[0m[0m primary_file_microsoft_endpoint    = (known after apply)
      [32m+[0m[0m primary_file_microsoft_host        = (known after apply)
      [32m+[0m[0m primary_location                   = (known after apply)
      [32m+[0m[0m primary_queue_endpoint             = (known after apply)
      [32m+[0m[0m primary_queue_host                 = (known after apply)
      [32m+[0m[0m primary_queue_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m primary_queue_microsoft_host       = (known after apply)
      [32m+[0m[0m primary_table_endpoint             = (known after apply)
      [32m+[0m[0m primary_table_host                 = (known after apply)
      [32m+[0m[0m primary_table_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m primary_table_microsoft_host       = (known after apply)
      [32m+[0m[0m primary_web_endpoint               = (known after apply)
      [32m+[0m[0m primary_web_host                   = (known after apply)
      [32m+[0m[0m primary_web_internet_endpoint      = (known after apply)
      [32m+[0m[0m primary_web_internet_host          = (known after apply)
      [32m+[0m[0m primary_web_microsoft_endpoint     = (known after apply)
      [32m+[0m[0m primary_web_microsoft_host         = (known after apply)
      [32m+[0m[0m public_network_access_enabled      = false
      [32m+[0m[0m queue_encryption_key_type          = "Account"
      [32m+[0m[0m resource_group_name                = "seclogic-dev-app-rg"
      [32m+[0m[0m secondary_access_key               = (sensitive value)
      [32m+[0m[0m secondary_blob_connection_string   = (sensitive value)
      [32m+[0m[0m secondary_blob_endpoint            = (known after apply)
      [32m+[0m[0m secondary_blob_host                = (known after apply)
      [32m+[0m[0m secondary_blob_internet_endpoint   = (known after apply)
      [32m+[0m[0m secondary_blob_internet_host       = (known after apply)
      [32m+[0m[0m secondary_blob_microsoft_endpoint  = (known after apply)
      [32m+[0m[0m secondary_blob_microsoft_host      = (known after apply)
      [32m+[0m[0m secondary_connection_string        = (sensitive value)
      [32m+[0m[0m secondary_dfs_endpoint             = (known after apply)
      [32m+[0m[0m secondary_dfs_host                 = (known after apply)
      [32m+[0m[0m secondary_dfs_internet_endpoint    = (known after apply)
      [32m+[0m[0m secondary_dfs_internet_host        = (known after apply)
      [32m+[0m[0m secondary_dfs_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m secondary_dfs_microsoft_host       = (known after apply)
      [32m+[0m[0m secondary_file_endpoint            = (known after apply)
      [32m+[0m[0m secondary_file_host                = (known after apply)
      [32m+[0m[0m secondary_file_internet_endpoint   = (known after apply)
      [32m+[0m[0m secondary_file_internet_host       = (known after apply)
      [32m+[0m[0m secondary_file_microsoft_endpoint  = (known after apply)
      [32m+[0m[0m secondary_file_microsoft_host      = (known after apply)
      [32m+[0m[0m secondary_location                 = (known after apply)
      [32m+[0m[0m secondary_queue_endpoint           = (known after apply)
      [32m+[0m[0m secondary_queue_host               = (known after apply)
      [32m+[0m[0m secondary_queue_microsoft_endpoint = (known after apply)
      [32m+[0m[0m secondary_queue_microsoft_host     = (known after apply)
      [32m+[0m[0m secondary_table_endpoint           = (known after apply)
      [32m+[0m[0m secondary_table_host               = (known after apply)
      [32m+[0m[0m secondary_table_microsoft_endpoint = (known after apply)
      [32m+[0m[0m secondary_table_microsoft_host     = (known after apply)
      [32m+[0m[0m secondary_web_endpoint             = (known after apply)
      [32m+[0m[0m secondary_web_host                 = (known after apply)
      [32m+[0m[0m secondary_web_internet_endpoint    = (known after apply)
      [32m+[0m[0m secondary_web_internet_host        = (known after apply)
      [32m+[0m[0m secondary_web_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m secondary_web_microsoft_host       = (known after apply)
      [32m+[0m[0m sftp_enabled                       = false
      [32m+[0m[0m shared_access_key_enabled          = true
      [32m+[0m[0m table_encryption_key_type          = "Account"

      [32m+[0m[0m blob_properties {
          [32m+[0m[0m change_feed_enabled      = false
          [32m+[0m[0m default_service_version  = (known after apply)
          [32m+[0m[0m last_access_time_enabled = false
          [32m+[0m[0m versioning_enabled       = false

          [32m+[0m[0m container_delete_retention_policy {
              [32m+[0m[0m days = 7
            }

          [32m+[0m[0m delete_retention_policy {
              [32m+[0m[0m days                     = 7
              [32m+[0m[0m permanent_delete_enabled = false
            }
        }

      [32m+[0m[0m network_rules {
          [32m+[0m[0m bypass                     = [
              [32m+[0m[0m "None",
            ]
          [32m+[0m[0m default_action             = "Deny"
          [32m+[0m[0m ip_rules                   = (known after apply)
          [32m+[0m[0m virtual_network_subnet_ids = (known after apply)

          [32m+[0m[0m private_link_access {
              [32m+[0m[0m endpoint_resource_id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/providers/Microsoft.Security/datascanners/storageDataScanner"
              [32m+[0m[0m endpoint_tenant_id   = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
            }
        }

      [32m+[0m[0m queue_properties (known after apply)

      [32m+[0m[0m routing {
          [32m+[0m[0m choice                      = "MicrosoftRouting"
          [32m+[0m[0m publish_internet_endpoints  = false
          [32m+[0m[0m publish_microsoft_endpoints = false
        }

      [32m+[0m[0m sas_policy {
          [32m+[0m[0m expiration_action = "Log"
          [32m+[0m[0m expiration_period = "1.00:00:00"
        }

      [32m+[0m[0m share_properties (known after apply)
    }

[1m  # module.storage_account.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "120s"
      [32m+[0m[0m id              = (known after apply)
    }

[1mPlan:[0m 31 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>